Revit 2024 API
IFCProductWrapper.GetAllObjects Method
 Gets all objects associated with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ICollection<IFCAnyHandle> GetAllObjects()
Visual Basic
Public Function GetAllObjects As ICollection(Of IFCAnyHandle)
Visual C++
public:
ICollection<IFCAnyHandle^>^ GetAllObjects()
Return Value
 The collection of objects.
See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace